# К реализованному классу Matrix в Домашнем задании 3 добавить следующее:
# 1. __add__ принимающий второй экземпляр класса Matrix и возвращающий сумму матриц, если передалась на вход матрица
# другого размера - поднимать исключение MatrixSizeError (по желанию реализовать так, чтобы текст ошибки содержал
# размерность 1 и 2 матриц - пример: "Matrixes have different sizes - Matrix(x1, y1) and Matrix(x2, y2)")

# 2. __mul__ принимающий число типа int или float и возвращающий матрицу, умноженную на скаляр/

# 3. __str__ переводящий матрицу в строку. Столбцы разделены между собой табуляцией, а строки — переносами строк
# (символ новой строки). При этом после каждой строки не должно быть символа табуляции и в конце не должно быть переноса
# строки.

class Matrix:

    def __init__(self, ):
        pass


if __name__ == "__main__":
    print("qqqqqqqwwwwwww")

